[
 {
  "title": "Studio Nut Produces 'Negaposi Angler' Original TV Anime for Fall 2024",
  "description": "Kadokawa opened an official website for an original anime titled Negaposi Angler (Negative Positive Angler), revealing the main cast, production staff, a teaser visual (pictured), and a teaser promotional video on Wednesday. The anime is scheduled to premiere in October 2024. Cas...",
  "creatdat": "4 hours ago",
  "createdby": "Nioxys",
  "tags": [
   "New AnimePreviewFall 2024"
  ]
 },
 {
  "title": "Anime Project of 'Sailor Zombie' Manga Announced",
  "description": "Publishing company Hero's announced an anime adaptation of Isshin Inudou and Jiji \u0026 Pinch's Sailor Zombie manga on Monday. Originally created as a drama series, Sailor Zombie aired in 12 episodes on TV Tokyo from April to July 2014, featuring members of the idol group AKB48. Inud...",
  "creatdat": "Yesterday, 4:24 PM",
  "createdby": "DatRandomDude",
  "tags": [
   "Adapts MangaNew Anime"
  ]
 },
 {
  "title": "Light Novel 'Yuusha Party wo Tsuihou sareta Shiro Madoushi, S-Rank Boukensha ni Hirowareru' Receives Anime Project",
  "description": "The Monster Label 10th Anniversary special website revealed an anime project for Sora Suigetsu's Yuusha Party wo Tsuihou sareta Shiro Madoushi, S-Rank Boukensha ni Hirowareru: Kono Shiro Madoushi ga Kikakugai Sugiru (The White Mage Who Was Banished From the Hero's Party Is Picked...",
  "creatdat": "Yesterday, 4:04 PM",
  "createdby": "Hyperion_PS",
  "tags": [
   "Light NovelsNew Anime"
  ]
 },
 {
  "title": "Light Novel 'Zutaboro Reijou wa Ane no Moto Konyakusha ni Dekiai sareru' Gets TV Anime in 2025",
  "description": "The Monster Label 10th Anniversary special website revealed a television anime adaptation of Tobirano's Zutaboro Reijou wa Ane no Moto Konyakusha ni Dekiai sareru (Loved by Her Sister's Former Fiancée) light novel on Monday. The television anime is scheduled to premiere in 2025....",
  "creatdat": "Yesterday, 2:38 PM",
  "createdby": "Hyperion_PS",
  "tags": [
   "Light NovelsNew Anime"
  ]
 },
 {
  "title": "Smartphone Game 'Project Sekai' Receives Anime Movie in January 2025",
  "description": "Advertising company CyberAgent announced on Monday an anime movie for the Project Sekai Colorful Stage! feat. Hatsune Miku smartphone game, titled Project Sekai Movie: Kowareta Sekai to Utaenai Miku (Colorful Stage! The Movie: A Miku Who Can't Sing), revealing the main cast, staf...",
  "creatdat": "Yesterday, 11:06 AM",
  "createdby": "Hyperion_PS",
  "tags": [
   "New AnimePreview"
  ]
 },
 {
  "title": "'Dark Machine' Game Gets Anime Project",
  "description": "The Dark Machine: The Game and Anime panel at the San Diego Comic Con announced an anime project on Saturday, revealing the main staff and a teaser promotional video. Staff Director: Kazumi Terada (Chikyuugai Shounen Shoujo assistant director) Creative Producer: Gorou Taniguchi...",
  "creatdat": "Jul 28, 5:14 PM",
  "createdby": "DatRandomDude",
  "tags": [
   "New AnimePreview"
  ]
 },
 {
  "title": "'Mononoke: Karakasa' Movie Sequel in Production [Update 7/28]",
  "description": "The stage greeting event commemorating the opening of the Mononoke: Karakasa anime movie revealed on Saturday that a second installment is in production. Voice actor Hiroshi Kamiya, who plays the lead character Kusuriuri (Medicine Seller) in the movie, mentioned that the recordin...",
  "creatdat": "Jul 27, 4:44 PM",
  "createdby": "Vindstot",
  "tags": [
   "New Anime"
  ]
 },
 {
  "title": "'Party kara Tsuihou sareta Sono Chiyushi, Jitsu wa Saikyou ni Tsuki' Reveals Additional Cast, Staff, First Promo",
  "description": "The official website for the Party kara Tsuihou sareta Sono Chiyushi, Jitsu wa Saikyou ni Tsuki (The Healer Who Was Banished From His Party, Is, in Fact, the Strongest) television anime series revealed on Saturday additional cast, staff, opening theme, and first promotional video...",
  "creatdat": "Jul 27, 11:49 AM",
  "createdby": "DatRandomDude",
  "tags": [
   "OP EDPreviewMore InfoFall 2024"
  ]
 },
 {
  "title": "'Binan Koukou Chikyuu Bouei-bu' Gets Anime Movie in Winter 2025",
  "description": "The official website of the Binan Koukou Chikyuu Bouei-bu LOVE! (Cute High Earth Defense Club LOVE!) anime series announced a movie on Saturday, titled Binan Koukou Chikyuu Bouei-bu Eternal Love! (Cute High Earth Defense Club Eternal Love!). The movie, commemorating the franchis...",
  "creatdat": "Jul 26, 10:14 PM",
  "createdby": "Hyperion_PS",
  "tags": [
   "New Anime"
  ]
 },
 {
  "title": "'Kakkou no Iinazuke' Gets Second Season in 2025",
  "description": "The official website of the television anime adapting Miki Yoshikawa's Kakkou no Iinazuke (A Couple of Cuckoos) manga announced a second season on Saturday. The new season is scheduled to premiere in 2025. Produced by SynergySP and Shin-Ei Animation, the 24-episode television ani...",
  "creatdat": "Jul 26, 9:52 AM",
  "createdby": "Hyperion_PS",
  "tags": [
   "Adapts MangaNew Anime"
  ]
 },
 {
  "title": "Web Manga 'Niwatori Fighter' Receives Anime Adaptation",
  "description": "The VIZ Media panel at San Diego Comic-Con announced an anime adaptation of Shuu Sakuratani's Niwatori Fighter (Rooster Fighter) manga on Thursday. The panel also revealed the main staff, a teaser visual (pictured), and a teaser promotional video. Staff Director: Daisuke Suzuki (...",
  "creatdat": "Jul 25, 3:58 PM",
  "createdby": "DatRandomDude",
  "tags": [
   "Adapts MangaNew AnimePreview"
  ]
 },
 {
  "title": "'Mahoutsukai ni Narenakatta Onnanoko no Hanashi' Announces Additional Cast",
  "description": "The official website of the Mahoutsukai ni Narenakatta Onnanoko no Hanashi (A Story of a Girl that was Unable to Become a Mage) television anime unveiled four additional cast members on Thursday. The anime is scheduled to premiere in October 2024 on MBS, TBS, and BS-TBS. Cast No...",
  "creatdat": "Jul 25, 1:11 PM",
  "createdby": "DatRandomDude",
  "tags": [
   "More InfoFall 2024"
  ]
 },
 {
  "title": "'Haigakura' Unveils More Cast",
  "description": "The official website of the television anime adaptation of Shinobu Takayama's Haigakura manga revealed three additional cast members on Thursday. The anime is scheduled to premiere in Fall 2024. Cast Hiki: Ryouhei Kimura (Mairimashita! Iruma-kun) Sanu: Ryouta Suzuki (Sabikui Bisc...",
  "creatdat": "Jul 25, 12:04 PM",
  "createdby": "DatRandomDude",
  "tags": [
   "More InfoFall 2024"
  ]
 },
 {
  "title": "Lead Cast of 'Ninja to Koroshiya no Futarigurashi' Announced",
  "description": "The official website of the Ninja to Koroshiya no Futarigurashi (The Life of a Ninja and an Assassin) television anime revealed two main voice cast and a second teaser visual on Thursday (pictured). Voice actresses Haruna Mikawa (Solo Leveling, Soredemo Ayumu wa Yosetekuru) and K...",
  "creatdat": "Jul 25, 4:30 AM",
  "createdby": "Vindstot",
  "tags": [
   "More Info"
  ]
 },
 {
  "title": "Web Manga 'Shakunetsu Kabaddi' Ends Serialization",
  "description": "Hajime Musashino's Shakunetsu Kabaddi (Burning Kabaddi) manga ended its nine-year serialization with chapter 293 on the Ura Sunday website on Tuesday. Musashino began serializing the sports manga on the MangaONE app in July 2015, followed by the Ura Sunday website. Shogakukan sh...",
  "creatdat": "Jul 24, 9:11 PM",
  "createdby": "DatRandomDude",
  "tags": [
   "Series End"
  ]
 },
 {
  "title": "'Chi.: Chikyuu no Undou ni Tsuite' Reveals Main Cast, Teaser Promo, Fall 2024 Premiere",
  "description": "Production company SKY Perfect Pictures opened an official website for the television anime adaptation of Uoto's Chi.: Chikyuu no Undou ni Tsuite (Orb: On the Movements of the Earth) manga and revealed the main cast, teaser visual (pictured), and a teaser promotional video. The a...",
  "creatdat": "Jul 24, 8:27 PM",
  "createdby": "DatRandomDude",
  "tags": [
   "PreviewMore InfoFall 2024"
  ]
 },
 {
  "title": "Manga 'Shounen no Abyss' Ends Serialization",
  "description": "Ryou Minenami's Shounen no Abyss (Boy's Abyss) manga ended its serialization with chapter 183 in the 34th issue of Young Jump magazine on Thursday. Minenami began serializing the psychological drama manga in Shueisha's Young Jump magazine in February 2020. The 17th volume went o...",
  "creatdat": "Jul 24, 3:30 PM",
  "createdby": "Hyperion_PS",
  "tags": [
   "Series End"
  ]
 },
 {
  "title": "'Lycoris Recoil' Gets Short Movies",
  "description": "The 2nd anniversary special program for the Lycoris Recoil television anime announced six short movies on Tuesday. Different staff members will be directing and storyboarding each of the six movies, with Shingo Adachi in charge of supervision. Character designer Imigimuru will al...",
  "creatdat": "Jul 23, 10:15 AM",
  "createdby": "Hyperion_PS",
  "tags": [
   "New Anime"
  ]
 },
 {
  "title": "Manga 'Kono Kaisha ni Suki na Hito ga Imasu' Gets TV Anime",
  "description": "An official website opened for a television anime adaptation of Akamaru Enomoto's Kono Kaisha ni Suki na Hito ga Imasu (I Have a Crush at Work) manga on Tuesday, revealing a teaser visual (pictured). Enomoto serialized the romance comedy manga in Morning from March 2019 to Januar...",
  "creatdat": "Jul 22, 12:16 PM",
  "createdby": "Nioxys",
  "tags": [
   "Adapts MangaNew Anime"
  ]
 },
 {
  "title": "Manga 'Rock wa Lady no Tashinami deshite' Gets TV Anime in 2025",
  "description": "Publishing company Hakusensha announced a television anime adaptation of Hiroshi Fukuda's Rock wa Lady no Tashinami deshite (Rock Is a Lady's Modesty) manga on Monday, revealing an illustration (pictured) by the author to celebrate the announcement. The anime is scheduled to prem...",
  "creatdat": "Jul 22, 9:47 AM",
  "createdby": "Nioxys",
  "tags": [
   "Adapts MangaNew Anime"
  ]
 }
]